In [1]:
import pandas as pd

In [21]:
df = pd.read_csv('data_scientist_salaries.csv')

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1602 entries, 0 to 1601
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Unnamed: 0      1602 non-null   int64
 1   company_name    1602 non-null   object
 2   job_title       1602 non-null   object
 3   min_experience  1602 non-null   int64
 4   avg_salary      1602 non-null   object
 5   min_salary      1602 non-null   object
 6   max_salary      1602 non-null   object
dtypes: int64(2), object(5)
memory usage: 87.7+ KB

In [7]:
df.head()

,Unnamed: 0,company_name,job_title,min_experience,avg_salary,min_salary,max_salary
0,0,TCS,Data Scientist,2,7.8L,4.5L,16.0L
1,1,Accenture,Data Scientist,2,12.8L,5.8L,23.0L
2,2,IBM,Data Scientist,2,13.4L,5.3L,25.0L
3,3,Cognizant,Data Scientist,2,9.8L,5.0L,18.0L
4,4,Capgemini,Data Scientist,2,8.6L,4.8L,14.6L

In [8]:
df = df.drop('Unnamed: 0', axis=1)

In [9]:
df.head()

,company_name,job_title,min_experience,avg_salary,min_salary,max_salary
0,TCS,Data Scientist,2,7.8L,4.5L,16.0L
1,Accenture,Data Scientist,2,12.8L,5.8L,23.0L
2,IBM,Data Scientist,2,13.4L,5.3L,25.0L
3,Cognizant,Data Scientist,2,9.8L,5.0L,18.0L
4,Capgemini,Data Scientist,2,8.6L,4.8L,14.6L

In [10]:
df = df.drop('min_salary', axis=1)
df = df.drop('max_salary', axis=1)

In [11]:
df.head()

  company_name       job_title  min_experience avg_salary
0          TCS  Data Scientist               2       7.8L
1    Accenture  Data Scientist               2      12.8L
2          IBM  Data Scientist               2      13.4L
3    Cognizant  Data Scientist               2       9.8L
4    Capgemini  Data Scientist               2       8.6L

In [12]:
df['avg_salary'] = df['avg_salary'].str.rstrip('L')
df['avg_salary'] = pd.to_numeric(df['avg_salary'])

In [13]:
df.head()

  company_name       job_title  min_experience  avg_salary
0          TCS  Data Scientist               2         7.8
1    Accenture  Data Scientist               2        12.8
2          IBM  Data Scientist               2        13.4
3    Cognizant  Data Scientist               2         9.8
4    Capgemini  Data Scientist               2         8.6

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1602 entries, 0 to 1601
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   company_name    1602 non-null   object
 1   job_title       1602 non-null   object
 2   min_experience  1602 non-null   int64
 3   avg_salary      1602 non-null   float64
dtypes: float64(1), int64(1), object(2)
memory usage: 50.2+ KB

In [15]:
df.to_csv('data_scientist_salaries_dataset.csv', index=False)

In [16]:
df.describe()

       min_experience   avg_salary
count     1602.000000  1602.000000
mean         2.799001    13.234894
std          2.353686     7.840744
min          0.000000     1.400000
25%          1.000000     7.600000
50%          2.000000    11.900000
75%          4.000000    17.175000
max         21.000000    82.000000

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1602 entries, 0 to 1601
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   company_name    1602 non-null   object
 1   job_title       1602 non-null   object
 2   min_experience  1602 non-null   int64
 3   avg_salary      1602 non-null   float64
dtypes: float64(1), int64(1), object(2)
memory usage: 50.2+ KB

In [18]:
null_counts = df.isnull().sum()

# Display the null counts for each column
print(null_counts)

company_name      0
job_title         0
min_experience    0
avg_salary        0
dtype: int64